In [3]:
import pandas as pd

a=[1,2,3,4]
s1=pd.Series(a)
s1.index=['a','b','c','d']
print(s1)
print(type(s1))
print(s1.shape)
print(s1.index)

a    1
b    2
c    3
d    4
dtype: int64
<class 'pandas.core.series.Series'>
(4,)
Index(['a', 'b', 'c', 'd'], dtype='object')

In [4]:
a={'a':10,'b':20,'c':30}
s2=pd.Series(a)
s2

a    10
b    20
c    30
dtype: int64

In [5]:
names=['kim','lee','park','hong','jang']
scores=[85,70,75,90,95]
majors=['컴공','정보통신','경영','컴공','경영']

data={'name':names, 'score':scores,'major':majors}
df=pd.DataFrame(data)
df

   name  score major
0   kim     85    컴공
1   lee     70  정보통신
2  park     75    경영
3  hong     90    컴공
4  jang     95    경영

In [23]:
data1=[names, majors,scores]
df=pd.DataFrame(data1).T
df.columns=['name','major','score']
df['grade']=[1,3,2,1,4]
df['level']=["B","C","C","A","A"]
df

   name major score  grade level
0   kim    컴공    85      1     B
1   lee  정보통신    70      3     C
2  park    경영    75      2     C
3  hong    컴공    90      1     A
4  jang    경영    95      4     A

In [30]:
#del df['grade']
df.index=['a','b','c','d','e']
df[['score','major','name']]

  score major  name
a    85    컴공   kim
b    70  정보통신   lee
c    75    경영  park
d    90    컴공  hong
e    95    경영  jang

In [44]:
#print(df.iloc[1:3])
print(df.loc['a':'d',['name','major']])
df

   name major
a   kim    컴공
b   lee  정보통신
c  park    경영
d  hong    컴공

   name major score
a   kim    컴공    85
b   lee  정보통신    70
c  park    경영    75
d  hong    컴공    90
e  jang    경영    95

In [46]:
df.loc[df.major=='컴공',['name','major']]

   name major
a   kim    컴공
d  hong    컴공

In [48]:
names=['kim','lee','park','hong','jang']
kor=[80,85,95,90,75]
eng=[85,90,100,95,75]
math=[80,75,90,85,80]

name, kor, eng, math 리스트 값을 사용하여 DataFrame를 작성하시오
total=kor+eng+math
avg=total/3

In [52]:
df=pd.DataFrame({'name':names,'kor':kor,'eng':eng,'math':math})
df['total']=df.kor+df.eng+df.math
df['avg']=df.total/3
df

   name  kor  eng  math  total        avg
0   kim   80   85    80    245  81.666667
1   lee   85   90    75    250  83.333333
2  park   95  100    90    285  95.000000
3  hong   90   95    85    270  90.000000
4  jang   75   75    80    230  76.666667

이름이 lee인 사람의 국어 점수를 검색하라.
평균이 90점 이상인 사람의 이름과 평균을 검색하라.
인덱스를 사용하여 1행~3행까지 이름, total, avg를 검색하라.

In [59]:
df.loc[df.name=='lee',['name','kor']]
df.loc[df.avg>=90,['name','avg']]
df.iloc[:3,[0,4,5]]
df['합격여부']=['합격' if a>=90 else '불합격' for a in df['avg']]
df

   name  kor  eng  math  total        avg 합격여부
0   kim   80   85    80    245  81.666667  불합격
1   lee   85   90    75    250  83.333333  불합격
2  park   95  100    90    285  95.000000   합격
3  hong   90   95    85    270  90.000000   합격
4  jang   75   75    80    230  76.666667  불합격

In [68]:
df.index=['a','b','c','d','e']
df

   name  kor  eng  math  total        avg 합격여부
a   kim   80   85    80    245  81.666667  불합격
b   lee   85   90    75    250  83.333333  불합격
c  park   95  100    90    285  95.000000   합격
d  hong   90   95    85    270  90.000000   합격
e  jang   75   75    80    230  76.666667  불합격

In [69]:
df.describe()

             kor         eng       math       total        avg
count   5.000000    5.000000   5.000000    5.000000   5.000000
mean   85.000000   89.000000  82.000000  256.000000  85.333333
std     7.905694    9.617692   5.700877   21.621748   7.207249
min    75.000000   75.000000  75.000000  230.000000  76.666667
25%    80.000000   85.000000  80.000000  245.000000  81.666667
50%    85.000000   90.000000  80.000000  250.000000  83.333333
75%    90.000000   95.000000  85.000000  270.000000  90.000000
max    95.000000  100.000000  90.000000  285.000000  95.000000

In [72]:
df.sum(axis=0)

name     kimleeparkhongjang
kor                     425
eng                     445
math                    410
total                  1280
avg              426.666667
합격여부          불합격불합격합격합격불합격
dtype: object

In [ ]:
#python open()함수
#csv 모듈
#pandas 모듈

In [76]:
infilpath="data/input.csv"
outfilepath='data/output1.csv'

In [87]:
#python open
with open(infilpath,'r',newline='') as reader:
    with open(outfilepath,'w',newline="") as writer:
        header=reader.readline()
        header=header.strip()
        header_list=header.split(',')
        print(header_list)
        #print(type(header_list))

        writer.write(','.join(header_list)+"\n")
        for row in reader:
            row=row.strip()
            row_list=row.split(',')
            print(row_list)
            writer.write(','.join(row_list)+"\n")

['Supplier Name', 'Invoice Number', 'Part Number', 'Cost', 'Purchase Date']
['A', '001-1001', '2341', '"$500', '000"', '2014-01-20']
['A', '001-1001', '5467', '500000', '2014-01-20']
['A', '001-1001', '5407', '750000', '2014-01-20']
['A', '001-1001', '2341', '750000', '2014-01-20']
['B', '50-9501', '7009', '250000', '2018-01-30']
['B', '50-9501', '7009', '250000', '2018-01-30']
['B', '50-9505', '6650', '125000', '2017-02-03']
['B', '50-9505', '6650', '125000', '2017-02-03']
['C', '920-4803', '3321', '615000', '2017-02-03']
['C', '920-4804', '3321', '615000', '2017-02-10']
['C', '920-4805', '3321', '615000', '2017-02-17']
['C', '920-4806', '3321', '615000', '2017-02-24']

In [90]:
df=pd.read_csv(outfilepath)
print(df)
df.to_csv("data/output2.csv",index=False)

   Supplier Name Invoice Number  Part Number      Cost Purchase Date
0              A       001-1001         2341  $500,000    2014-01-20
1              A       001-1001         5467    500000    2014-01-20
2              A       001-1001         5407    750000    2014-01-20
3              A       001-1001         2341    750000    2014-01-20
4              B        50-9501         7009    250000    2018-01-30
5              B        50-9501         7009    250000    2018-01-30
6              B        50-9505         6650    125000    2017-02-03
7              B        50-9505         6650    125000    2017-02-03
8              C       920-4803         3321    615000    2017-02-03
9              C       920-4804         3321    615000    2017-02-10
10             C       920-4805         3321    615000    2017-02-17
11             C       920-4806         3321    615000    2017-02-24

In [119]:
df=pd.read_csv(infilpath)
#print(df)
df['Cost']=df['Cost'].str.strip('$').str.replace(",","").astype(float)
result=df.loc[(df['Supplier Name']=='C') | (df['Cost']<250000),:]
#print(result)
result.to_csv("data/output3.csv",index=False)

   Supplier Name Invoice Number  Part Number      Cost Purchase Date
6              B        50-9505         6650  125000.0    2017-02-03
7              B        50-9505         6650  125000.0    2017-02-03
8              C       920-4803         3321  615000.0    2017-02-03
9              C       920-4804         3321  615000.0    2017-02-10
10             C       920-4805         3321  615000.0    2017-02-17
11             C       920-4806         3321  615000.0    2017-02-24

In [123]:
df=pd.read_csv(infilpath)
#print(df)
df['Cost']=df['Cost'].str.strip('$').str.replace(",","").astype(float)
df2=df[['Supplier Name','Cost']]
result=df2.groupby('Supplier Name').mean()
print(result)

                   Cost
Supplier Name
A              625000.0
B              187500.0
C              615000.0

In [105]:
#python open, 조건 검색 행만 선택하기
#supplier name이 A이고 cost가 700000이상인 데이터 선택
with open(infilpath,'r',newline='') as reader:
    with open(outfilepath,'w',newline="") as writer:
        header=reader.readline()
        header=header.strip()
        header_list=header.split(',')
        print(header_list)
        #print(type(header_list))

        writer.write(','.join(header_list)+"\n")

['Supplier Name', 'Invoice Number', 'Part Number', 'Cost', 'Purchase Date']

Supplier Name가 C이거나 Cost가 250,000 미만인 것을 선택하라.

In [80]:
kk=['red','blue','green']
str=','.join(kk)
print(str)

red,blue,green

In [81]:
ll=str.split(',')
print(ll)

['red', 'blue', 'green']

In [67]:
#리스트 컴프리헨션

a=[]
for i in range(0,10,1):
    a.append(i)
print(a)

b=[i for i in range(10)]
print(b)

c=[i for i in range(10) if i%2==1]
print(c)

d=[i if i%2==0 else 0 for i in range(10)]
print(d)

e=[[i*j for j in range(5)] for i in range(10,15)]
print(e)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[1, 3, 5, 7, 9]
[0, 0, 2, 0, 4, 0, 6, 0, 8, 0]
[[0, 10, 20, 30, 40], [0, 11, 22, 33, 44], [0, 12, 24, 36, 48], [0, 13, 26, 39, 52], [0, 14, 28, 42, 56]]